# 1.计算圆的周长和面积  半径自己定义

# r=2
# PI=3.14
# s=PI*r**2
# l=PI*r*2
# print(s)
# print(r)

# 2.打印出以下图形
# **********
# *        *
# *        *
# *        *
# **********

# print('********')
# print('*      *')
# print('*      *')
# print('*      *')
# print('********')

# 3.用程序打印出来：
# 从凌晨0:0:0 开始到现在已经57000秒
# 请问现在是 几时 几分 几秒

# m=57000//60
# m1=m%60
# h=m//60
# s=57000%60
# print(h,':',m1,':',s)

# 4.输入一个成绩 判断是否及格

# n=int(input('请输入成绩：'))
# if 100>=n>=60:
#     print('成绩合格 ')
# elif 0<=n<60:
#     print('成绩不合格')
# else:
#     print('输入有误')

# 5.输入成绩进行分类
# 小于等于60 不及格  60-70(包含70) 及格
# 70-90 良好 90-100 优秀

# n=int(input('输入成绩：'))
# if 0<=n<=60:
#     print('成绩不及格')
# elif 60<n<=70:
#     print('成绩及格')
# elif 70<n<=90:
#     print('成绩良好')
# elif 90<n<=100:
#     print('成绩优秀')
# else:
#     print('输入有误')

# 6.把1-12个月进行分类
# 春季 1-3    1 2 3
# 夏季 4-6    4 5 6
# 秋季 7-9    7 8 9
# 冬季 10-12  10 11 12

# n=int(input('输入月份：'))
# if 0<n<=3:
#     print('春季')
# elif 3<n<=6:
#     print('夏季')
# elif 6<n<=9:
#     print('秋季')
# elif 9<n<=12:
#     print('冬季')
# else:
#     print('输入有误')

# 7.上海地铁收费 5站以内收费4元
# 超过5站 每多一站加收1元
# 超过16站收费统一收费16元
# 输入站数计算需要交费多少？

# n=int(input('你坐几站：'))
# if 0<n<=5:
#     print('收费4元')
# elif 5<n<=16:
#     print('收费',4+(n-5),'元')
# elif n>16:
#     print('收费16元')
# else:
#     print('输入有误')

# 8.输入年份 判断是否是闰年
# 闰年：能被4整除但不能被100整除，或能被400整除的年份即为闰年

# n=int(input('请输入年份：'))
# if n%400==0 or n%4==0 and n%100!=0:
#     print('闰年')
# else:
#     print('平年')

# 9.3500以下不交税
# 3500-5000 税率为3%
# 5000-8000 税率为10%
# 8000-13000 税率为20%
# 13000以上 税率为30%
# 计算所交税额

# n=int(input('输入工资：'))
# if 0<n<=3500:
#     print('税费0元')
# elif 3500<n<=5000:
#     print('税费',(n-3500)*0.03,'元')
# elif 5000<n<=8000:
#     print('税费',(n-5000)*0.1+1500*0.03,'元')
# elif 8000<n<=13000:
#     print('税费',(n-8000)*0.2+3000*0.1+1500*0.03,'元')
# elif n>13000:
#     print('税费',(n-13000)*0.3+5000*0.2+3000*0.1+1500*0.03,'元')
# else:
#     print('输入有误')

# 10. 猜数字：
# 	写一个程序让他人进行猜测
# 	显示猜大了 还是猜小了  还是猜对了

# n=5
# m=int(input('输入一个数字：'))
# if n<m:
#     print('大')
# elif n>m:
#     print('小')
# else:
#     print('对')

# 11.输入一个字符串，打印字符串的第一个字符
# 中间字符
# 最后一个字符，
# 如果是偶数中间字符则打印为‘ * ’

# n=input('输入一个字符串:')
# if len(n)%2==0:
#     print(n[0],'*',n[-1])
# else:
#     print(n[0],n[1:len(n)-1],n[-1])

# 12.输入一个字符串判断是否为回文(12321, abcba，上海自来水来自海上)

# n=input('输入一句话：')
# if n==n[::-1]:
#     print('回文')
# else:
#     print('不是回文')

# 13.a = "hello python 我喜欢"
# b = "隔壁老王"
# c = "你媳妇回娘家了"
# 打印出
# "隔壁老王喜欢你媳妇"

# a = "hello python 我喜欢"
# b = "隔壁老王"
# c = "你媳妇回娘家了"
# print(b,a[-2::],c[:3:])

# 14.打印100以内的偶数
# 打印100以内的奇数

# n=2
# while 0<=n<=100:
#         print(n,end=' ')
#         n+=2
# print()
# n=1
# while 0<=n<=100:
#         print(n,end=' ')
#         n+=2

# 15.打印出"ABCD.....XYZ"

# n=ord('A')
# while n<=ord('Z'):
#     print(chr(n),end=' ')
#     n+=1
#
# 16.打印一个
# *
# **
# ***
# ****
# *****

# for x in range(1,6):
#     print(x*'*')

# 17.打印出
# 1  2  3  4  5
# 6  7  8  9  10
# 11 12 13 14 15
# 16 17 18 19 20

# for x in range(1,21):
#     if x%5==0:
#         print('%02d' % x,end='\n')
#     else:
#         print('%02d' % x,end=' ')

#
# 18.打印9*9乘法口诀:
# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9
# .....
# .......
# 1*9=9 2*9=18 3*9=27 4*9=36 5*9=45.....9*9=81
#
#  需要用到print("内容" sep=" ",end=" ")

# m=1
# while m<10:
#     n=1
#     while n<=m:
#         print(n,'x',m,'=',n*m,end=' ',sep=' ')
#         n+=1
#     print(end='\n')
#     m+=1

# 19.进行猜数字游戏：
# 规则：只能猜5次，显示猜大了 还是猜小了  还是猜对了
# 系统给定的数字为：
# import random
# random.randint(0,100)   100内的随机数

# import random
# s=random.randint(0,100)
# n=0
# while n<5:
#     l=int(input('输入数字：'))
#     if l<s:
#         print('小')
#     elif l>s:
#         print('大')
#     else:
#         print('对')
#         break
#     n+=1

# 20.分开打印20 以内的偶数 和奇数

# for x in range(21):
#     if x%2==0:
#         print(x,end=' ')
# print()
# for c in range(21):
#     if c%2!=0:
#         print(c,end=' ')

# 21.计算出100-1000之间的水仙花数
# 水仙花数指百位的立方+十位的立方+个位的立方等于原数字
# 例如  153 = 1**3 + 5**3 + 3**3

# for x in range(100,1000):
#     a=x//100
#     b=(x-a*100)//10
#     c=x%10
#     if x==a**3+b**3+c**3:
#         print(x)

# 22.打印10万内的 一个数加上100后是完全平方数
# 在加上168又是一个完成平方数
# 完全平方数 s+100=a*a    s+100+16=b*b

# for x in range(100000):
#     if (x+100)**0.5%1==0 and (x+268)**0.5%1==0:
#         print(x)

# 23.打印楼梯用*表示楼梯
# 空余练习：打印左三角  右三角 倒三角
# *
# **
# ***
#
#   *
#  **
# ***
#
# ***
# **
# *

# for x in range(1,4):
#     print(x*'*')

# for x in range(3,0,-1):
#         print(x*'*')

# for x in range(2,-1,-1):
#     for c in range(1,4):
#         if x+c==3:
#             break
#     print(x*' '+c*'*')


# 24.将4个数(1,2,3,4)可能组成的所有
# 且互不相同无重复的3位数字的排列组合
# 123 124 321 ......

# for a in range(1,5):
#     for b in range(1,5):
#         for c in range(1,5):
#             if a!=b and b!=c and c!=a:
#                 print(a,b,c)

# 25.顺序输入年月日，判断该日期是该年的第几天
# 思路：
# 判断是闰年还是平年
# 判断月份是否大于2
# 计算当前月之前的所有天数
# 一共多少天

# a=int(input('输入年：'))
# b=int(input('输入月：'))
# c=int(input('输入日：'))
# m=(0,31,59,90,120,151,181,212,243,273,304,334)
# m1=m[b-1]
# if 0<b<=12:
#     s=m1+c
# if a%400==0 or (a%4==0 and a%100==0):
#     if b>2:
#         s=m1+c+1
#     print('第',s,'天')

# 26.打印出国际象棋的棋盘黑色为* 白色为0  以8格为例
#
# *0*0*0*0
# 0*0*0*0*
# *0*0*0*0
# 0*0*0*0*
# *0*0*0*0
# 0*0*0*0*
# *0*0*0*0
# 0*0*0*0*

# for n in range(8):
#     for m in range(8):
#         if (n+m)%2==0:
#             print('0',end=' ')
#         else:
#             print('*',end=' ')
#     print()


# 27.判断1000内既能被3整除也能被5整取还能被7整除的数 并打印出来

# for x in range(1000):
#     if x%3==0 and x%5==0 and x%7==0:
#         print (x)

# 28.判断1000以内的质数并打印

# for x in range(1,1000):
#     for c in range(2,x):
#         if x%c==0:
#             break
#     else:
#         print(x)

# 29.模拟用户登录
# 类似输入用户名和密码并进行判断，有5次输入机会
# 如果输入正确显示用户信息，
# 错误提示请重新输入并显示还有几次机会

# a='li'
# b=123
# for x in range(4,-1,-1):
#     n = input('输入用户名：')
#     k = int(input('输入密码：'))
#     if n==a and b==k:
#         print('yes')
#     else:
#         print('no')
#     print('还有',x,'次机会')

# 30.输入一个数，先判断是否为质数，如果是加入列表中再次输入
# 任意数，再判断..... 直到输入的数小于等于0为止
# 最后打印质数列表（知识点：死循环 for range 列表.....）

# l=[]
# while True:
#     n=int(input('输入一个数字：'))
#     if n<0:
#         break
#     for x in range(2,n):
#         if n%x==0:
#             break
#     else:
#         l.append(n)
# print(l)

# 31.进行石头剪刀布游戏
# 输入石头剪刀布，如果输入是
# 'q'
# 就退出比赛，
# 否则一直进行石头剪刀布游戏
# 输入石头或者剪刀或者布进行判断，是你赢了还是电脑赢了或者平局
# import random
# random.choice(s)

# s=['剪刀','石头','布']
# import random
# x=random.choice(s)
# while True:
#     n=input('输入剪刀石头布：')
#     a=[['剪刀','布'],['石头','剪刀'],['布','石头']]
#     if n=='q':
#         break
#     elif [n,x] in a:
#         print('win')
#         break
#     elif x==n:
#         print('dogfall')
#     else:
#         print('lost')

# 32.生成一个有30个数的斐波那契数列
# 1 1 2 3 5 8 ......

# l=[1,1]
# [l.append(l[x]+l[x+1]) for x in range(28)]
# print(l)

# l=[1,1]
# for x in range(28):
#     n=l[x]+l[x+1]
#     l.append(n)
# print(l)

# 33.有一分数列 2/1，3/2, 5/3，8/5, 13/8, 21/13 ...
# 求出这个数列的前20项的和
#
# 前4的和  6.7666666666666675
# 和为 ： 32.66026......
#
# 1 2 3 5 8 13 21 ........

# l=[1,2]
# i=[]
# for x in range(20):
#     n=l[x]+l[x+1]
#     l.append(n)
#     m=l[x+1]/l[x]
#     i.append(m)
# print(sum(i))

